# Welcome to the Data Manipulation Exercises

The workbook has been broken up into three sections.  Each section correlates to a reading assignment within the textbook.

In [2]:
import pandas as pd
import numpy as np

data= pd.read_csv("titanic.csv")

## Before You Get Started

We are going to be using the Titanic Dataset. Make sure to run a head() before you start working with manipulation methods.

In [17]:
# Run the head of your data set here:
data.head()

In [5]:
# check for duplicates
data.duplicated().sum()

np.int64(107)

In [19]:
# if there are, go ahead and drop them:
data.drop_duplicates()

### Cleaning Note:

While the columns are not the "prettiest", don't adjust any of them yet. We are going to update some values and add some values as we workthrough this notebook. Apologies for the extra visual "noise" on your screen. You will be given the option to tidy up the columns at the end of this notebook.

## Running Tables Note:  
If your tables don't appear to have accepted your changes, try the "Run All" option in the "Cell" section of the menu bar.

<span style="background-color:dodgerblue; color:dodgerblue;">- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</span>

# A. Aggregation

1. Work through the section Exercises.  
    - There are 4 sections in part A:
        - Groupby
        - Aggregation Methods
        - Groupby and Basic Math
        - Groupby and Multiple Aggregations

#### Creating Variables.

As we begin to manipulate our data, create new variables to store your work in.  This will keep your original data in tact.  Having the original dataset available will save you time with each manipulation.  You can also create variable names that inform you of the purpose of the manipulation.

### 1: Groupby <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

#### Groupby "embark_town"

1. Using the titanic data set, groupby "embark_town".
1. Create a variable that will represent the grouping of data. 
1. Initialize it using the groupby() function and pass it the column.

In [6]:
# Code your groupby "embark_town" here:
embark_town=data.groupby("embark_town")

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,alive,alone
embark_town,,,,,,,,,,,,,,
Cherbourg,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,yes,False
Queenstown,0,3,male,2.0,0,0,8.4583,Q,Third,man,True,C,no,True
Southampton,0,3,male,22.0,1,0,7.2500,S,Third,man,True,C,no,False

In [21]:
# To view the grouped data as a table, use the variable_name.first():
embark_town.first()

#### Groupby "survived"

Did you know that you can also chain on some of our exploratory methods to the groupby method?

1. Create & initalize a new variable to hold a table that will groupby "survived" 
1. Use method chaining to tack on the describe method

In [22]:
# Code your groupby "survived" table here:

survived = data.groupby("survived").describe()

# run your table below:

In [23]:
# run your table with describe
survived.describe()

In [24]:
# How is this table organized?  Why are there 40 columns now?
# The table is now a wide format table. Each of the describe columns are displayed across the data frame by each of the original columns.

### 2. Aggregation Methods <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

Note: **agg()** and **aggregate()** are identical [source](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.aggregate.html)

#### Method Chaining

1. Create a variable to method chain **head()** and **agg()** togehter.
1. Pass one of the following statistical values to **agg()**
   - "mean", "median", "mode", "min", "max", "std", "var", "first", "last", "sum"

In [25]:
# Code your method chain here:
    
mean_data=(data
    .agg(average_age=('age','mean'))
    .head())

In [7]:
# Create a variable to method chain head() with agg("sum")

# run your table:
sum_data=data.head().agg("sum",numeric_only=True)
sum_data.head()

survived      3.0
pclass       11.0
age         156.0
sibsp         3.0
parch         0.0
dtype: float64

In [27]:
# Explain the sum table.  What is going on with the "sex", "class", and "alive" columns?

#  Those are not numerical fields so they cannot be summed. All the values are returned in a single string.

#### Using a Dictionary <span style="color:darkorange;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 
##### A dictionary is a Python collection type.  

Is a collection type that stores **key-value pairs**.  A key-value pair is an organization system that is made up of a single *key* that has one or more *values* paired with it.  
Think of it like your contacts list.  The contacts list is the dictionary object.  
Each contact is organized by a key, usually name.  And attached to each name is contact information, or the values.
Some contacts might have email address, phone number, home or work address, etc. Other contacts may just be a name and phone number.  This is a very simple example, but understanding this organizational structure will be helpful as you learn to manipulate tables.  

*Here is a dictionary example with 3 keys:*
>**contacts_dictionary = {"name1": ["email", 555-5552, "work info"], 
      "name2": ["email", 555-5554],
      "name3": 555-5555}**
                     
*Here is a dictionary example with a single key-value pair*
**study_group_dictionary = {"john": ["john@email.com", 555-555-5555, "works at LaunchCode headquarters"]}**   

It has a single key, and a list of values. The organization of this structure is called a "Key-Value Pair".
Using the contact list example, the key would be the name of the person and the values would be their contact information.  The key is a single item (the person's name) and the values can be a single item (an email address) or mulitple items (email, phone number, address, work info, etc).
Keys and values can be any data type, but must use correct data type syntax.  The keys do not have to be strings, but they do need to be a single value.  

For more information, you can read more on dictionary objects [here](https://www.w3schools.com/python/python_dictionaries.asp).

#### Aggregation across multiple columns using dictionary functionality

##### Syntax Example:

**age_dictionary={"age":["sum", "max"]}**

We are creating a new dictionary (**age_dictionary**).  The key is **age** and the values we want are **"sum""** and **"max"**.  This dictionary object has now become a tempate for the aggregations we want to preform.  However, on it's own, it does nothing.  Once passed to the **agg()** method, it will pick out the specific location of data we want to examine.  Making a subset table.  

The code is contained in the box below.  Run it and see what happens.


For syntax examples, review [this webpage](https://www.geeksforgeeks.org/python-pandas-dataframe-aggregate/).
#### <span style="color:coral;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

In [ ]:
# Predict the table output before you uncomment the code below.
# My predictions is an age column with rows of sum and max

# age_dictionary={"age":["sum", "max"]}
# dictionary_agg=data.agg(age_dictionary)
# dictionary_agg

1. What if we want to look at more than one column at a time?  We pass more dictionaries to the agg function.
1. Create a variable to hold at least 3 columns.  Use the syntax from the "Syntax Example" as a guide.
    - Aggregate the following:  survived: "sum" & "count"; age: "std" & "min", and sibsp: "count" & "sum"

In [29]:
# Code your dictionary here:
age_dictionary={"survived":["sum","count"],
                "age":["std","min"],
                "sibsp":["count","sum"]
                }
dictionary_agg=data.agg(age_dictionary)

### 3. Groupby and Basic Math <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

1. Groupby "pclass".  Make sure you use a variable to hold your grouped data.

In [30]:
# Code your groupby here:

# <WARNING> For this section, you will need to filter out non-numeric data to run the aggregations
## Uncomment the line below, and use this 'num_only_data' variable as needed for Section 3 and Section 4
# num_only_data = data.select_dtypes(include='number')


# Run your table using first() here instead of head():
passenger_class=data.select_dtypes(include='number')
pclass_df=passenger_class.groupby('pclass')


# Run your table using first() here instead of head():
pclass_df.first()

### 4. Groupby and Multiple Aggregations <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

#### Group with a List<span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

1. We want to do muliple aggregation functions to our newly grouped data set.  We created a variable to hold a list of functions we want to perform.  These functions are part of the agg method.  When we pass our list to the method, the method will iterate through each item and perform that function for the entire table.

In [31]:
# our list of functions
agg_func_list = ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']


#Apply the agg method to our passenger_class variable (made in the Groupby Basic Math section).  
# Pass our list to the function and run your table.
pclass_df.agg(agg_func_list)

#### Group with a Dictionary<span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

Using only a list provides us with the entire table.  What if we only want to look at age vs pclass?  

we can create a dictionary to hold the age column for us.  The *key* would be the name of our column, and the values our list of functions to perform on that column.  The code would look like this:

In [32]:
agg_func_dict = {
    'age':
    ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']
}
# We would run our table like this:
# passenger_class.agg(agg_func_dict)

Looking at the *age_func_dict* syntax, create a dictionary variable for the "survived" column and pass it to **passenger_class.agg()** in the box below.

In [33]:
# Code it here:
agg_func_dict = {
    'survived':
    ['sum', 'mean', 'median', 'min', 'max', 'std', 'var', 'first', 'last', 'count']
}

pclass_df.agg(agg_func_dict)

<span style="background-color:dodgerblue; color:dodgerblue;">- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</span>

# B. Recoding and Creating New Values and Variables 

1. Work through the Part B, there are 3 sections

### Create a New Column <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

In the box below:
1. Create a new column by manipulating the values of an existing column.  Specifically, create a new column, "fare_2021" that allows us to compare the cost of fare in pounds back in 1912 to 2021.  [This website](https://www.in2013dollars.com/uk/inflation/1912) can help you find the 2021 fare amount.

In [34]:
# Code your new "fare_2021" column here:
data['fare_2021']=data['fare']*119.25


# Run the head of your table to see your new column:
data.head()

### Replacing Values <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 
 
Replace the string-based "yes","no" values in the "alive" column using booleans, replacing "yes" values with True and "no" values with False.

In [35]:
# Code your updated values here:
data['alive']=data['alive'].replace(to_replace={"no": False, "yes": True})

data.head()

We can also use functions to update values.

1. Create a function that will convert the string-based "alive" values of "yes" or "no" to a boolean value of True or False. Apply it to your table and run your table here:

In [13]:
# Code your function here:
def alive_to_true_false(data):
    

    if data =="yes" or data==True:
        return True
    else:
        return False
    

data["alive"]=data["alive"].apply(alive_to_true_false)
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,False,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,True,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,True,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,True,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,False,True

### Using a function to create a new column <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

Sometimes you might want to create a new column based on combining multiple columns together.

1. create an "age_group" column that breaks years up as 0-19, 20-29, 30-39, etc until all given ages are covered.  Make sure you check to see where you can stop counting by 10s.

In [14]:
# Write your max age check here:
age_check = data["age"].agg("max")
age_check

np.float64(80.0)

In [17]:
# Code the new "age_group" column function here:


def age_group(age):
  
    if age < 20:
        return '0-19 years'
    elif 20 <= age < 30:
        return '20-29 years'
    elif 30 <= age <40:
        return '30-39 years'
    elif 40 <= age <50:
        return '40-49 years'
    elif 50 <= age  <60:
        return '50-59 years'
    elif 60 <= age <70:
        return '60-69 years'
    elif 70 <= age <80:
        return '70-79 years'
    elif 80 <= age <90:
        return '80-89 years'
    else:
        return 'unk'

# age_group_column(data)

data['age'].fillna(1000)

data["age_group"]=data["age"].apply(age_group)

<span style="background-color:dodgerblue; color:dodgerblue;">- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</span>

# C. Reshaping Tables

1. Work through Part C, there are 4 sections

### Sort_values <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

Use **sort_values()** to answer the following question:
> What is the age of the person who paid the highest fare?

Hint: We want to see the highest fare value first. To find this, should we set the sort order to ascending or descending?  Check the [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sort_values.html?highlight=sort_values#pandas.DataFrame.sort_values) for the syntax.

In [21]:
# Code your sort_values here:
sorted_df=data.sort_values(by='fare',ascending=False)
# sort_data=data.sort_values(by=["who","age"],ascending=False)

# Run your table here:
sorted_df.head
display(sorted_df)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_group
679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,True,False,30-39 years
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,True,True,30-39 years
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,True,True,30-39 years
88,1,1,female,23.0,3,2,263.0000,S,First,woman,False,C,Southampton,True,False,20-29 years
438,0,1,male,64.0,1,4,263.0000,S,First,man,True,C,Southampton,False,False,60-69 years
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
806,0,1,male,39.0,0,0,0.0000,S,First,man,True,A,Southampton,False,True,30-39 years
815,0,1,male,NaN,0,0,0.0000,S,First,man,True,B,Southampton,False,True,unk
466,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,False,True,unk
481,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,False,True,unk
822,0,1,male,38.0,0,0,0.0000,S,First,man,True,NaN,Southampton,False,True,30-39 years

### pivot_table <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 
1. pivot the table of the summed data where the values are "fare", index is "who" and "age_group", and the columns are "survived"

Hint: set the aggfunc parameter to np.sum

In [23]:
# Code your pivot_table here:

pivot_table = data.pivot_table(values='fare', aggfunc='sum', index=['who','age_group'],columns='survived')


# Run your table here:
print(pivot_table)

survived                   0          1
who   age_group
child 0-19 years   1109.5459  1611.6751
man   0-19 years    978.4249   145.5333
      20-29 years  2435.2329   646.9542
      30-39 years  1506.2789  1720.9459
      40-49 years  1110.6374   466.6793
      50-59 years   853.3042   226.2000
      60-69 years   586.4875    89.7000
      70-79 years   181.1834        NaN
      80-89 years        NaN    30.0000
      unk          1997.7913   376.7124
woman 0-19 years    126.1375  1243.0209
      20-29 years   404.7500  2514.4291
      30-39 years   164.9042  3350.8791
      40-49 years   241.2542  1563.6335
      50-59 years    39.2125  1182.0833
      60-69 years        NaN   242.7958
      unk           407.5751  1139.9875

### Wide to Long <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span> 

1. Create a table where the columns are "who" and the values are "pclass"
1. Answer the question:  How does this table differ from the pivot_table above?  Specifically, how is "who" different?

In [27]:
# Code your table here:
wide_long=data.pivot(columns="who",values="pclass")

# Run your table here:
wide_long.head()

# Answer the question here:
# who is an index vs who as column

who child          man        woman
0     NaN  20-29 years          NaN
1     NaN          NaN  30-39 years
2     NaN          NaN  20-29 years
3     NaN          NaN  30-39 years
4     NaN  30-39 years          NaN

### Melt <span style="color:dodgerblue;"> - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </span>

1.  What does the **melt** function do to the data?

In [42]:
# What does melt do?
# Converts table from wide to long

2.  With a new variable, apply a default melt to your data.

In [28]:
# Create your default melt table here with the following syntax:  new_name = pd.melt(data_set)

# Run your table here:
melt_df=pd.melt(data)

# Check the shape of your new table.
melt_df.shape

(14256, 2)

3. Create a melt table where the index variables are "embarked", and the values are "fare" and "deck"

In [44]:
# Create your melt table here:
melt_data=pd.melt(data, id_vars=["embarked"],value_vars=["fare","deck"])
# Run your table here:

# Check the shape
melt_data.shape
melt_data.head()

# Optonal Challenges:

1. Clean and Explore the table.  
    1. How would you handle any missing data?
    1. Would you keep all of the columns?
    1. Would you want to manipulate any data?